* Cl-Desktop 

** Usage

#+BEGIN_SRC lisp
(asdf:require-system :mcclim-desktop)
(mcclim-desktop:launcher-run)
#+END_SRC

#+RESULTS:
: #<SB-THREAD:THREAD "launcher" RUNNING {10047A4033}>

** Installation

** Applications

| Name          | What              | Source                                               | Quicklisp |
|---------------+-------------------+------------------------------------------------------+-----------|
| beirc         | irc               | https://github.com/MrNeutron/beirc                   | Yes       |
| clim-chess    | chess             | https://github.com/stassats/clim-chess               | No        |
| clim-pkg-doc  | package browser   | https://github.com/jschatzer/clim-pkg-doc            | Yes       |
| spectacle     | image editor      | https://github.com/slyrus/spectacle                  | No        |
| climc         | instant messaging | https://github.com/nlamirault/climc                  | Yes       |
| climon        | simon game        | https://github.com/nlamirault/climon                 | Yes       |
| ernestine     | music browser     | https://github.com/nlamirault/ernestine              | Yes       |
| sudoku-mcclim | sudoku            | https://github.com/tortkis/sudoku-mcclim             | No        |
| climacs       | editor            | https://github.com/robert-strandh/Climacs            | Yes       |
| gsharp        | score editor      | https://github.com/informatimago/gsharp              | Yes       |
| listener      | REPL              | https://github.com/robert-strandh/McCLIM             | Yes       |
| class-browser | class browser     | https://github.com/pocket7878/clim-class-browser.git | No        |
| scigraph      | plotting          | https://github.com/robert-strandh/McCLIM             | Yes       |
| mcclide       | ide               | https://github.com/gas2serra/mcclide                 | No        |

To Add

| Name                          | What         | Source                                                    |
|-------------------------------+--------------+-----------------------------------------------------------|
| FTD - The Flexi-Trivial Dired | file manager | https://github.com/gabriel-laddel/flexi-trivial-dired.git |

** Author

+ Alessandro Serra (gas2serra@gmail.com)

** Copyright

Copyright (c) 2016 Alessandro Serra (gas2serra@gmail.com)

** License

Licensed under the GPLv3 License.
